#!/usr/bin/env python3

# some of the OGL texts have Latin accidently interpreted as BETA code so this
# changes it back

a = "αβξδεφγηικλμνοπθρσςτυϝωχψΩ"
b = "abcdefghiklmnopqrsstuvwxyV"

# inp = "10.1  ιν ηις εργο στατε ετ δομινι εχεμπλαρ σε#3υιμινι, φιρμι ιν φιδε ετ ιμμυταβιλες, φρατερνιτατις αματορες, διλιγεντες ινϝιξεμ, ιν ϝεριτατε σοξιατι, μανσυετυδινε δομινι αλτερντρι πραεστολαντες, νυλλυμ δεσπιξιεντες."
# inp = "10.2 ξυμ ποσσιτις βενεφαξερε, νολιτε διλφερρε, #3υια ελεëμοσψνα δε μορτε λιβερατ. ομνες ϝολρις ινϝιξεμ συβιεξτι εστοτξ, ξονϝερσατιονεμ ϝεστραμ ιρρεπρενσιβιλεμ ηαβεντες ιν γεντιβυς, υτ εχ βονις οπεριβυς ϝεστρις ετ ϝος λαυδεμ αξξιπιατις ετ δομινυς ιν ϝοβις  νον βλασπηεμετυρ."
# inp = "10.3 Ωαε αυτεμ, περ #3υεμ νομεν δομινι βλασπηεματυρ. σοβριξτατεμ εργο δοξετξ ομνες, ιν #3υα ετ ϝος ξονϝερσαμινι."
# inp = "11.1 νιμις ξοντριστατυς συμ προ Ωαλεντε, #3υι πρεσβψτερ φαξτυς εστ αλι#3υανδο απυδ ϝος, #3υοδ σιξ ιγνορετ ις λοξυμ #3υι δατυς εστ ει. μονεο ιτα#3υε υτ αβστινεατις ϝος αβ αϝαριτια ετ σιτις ξαστι ϝεραξες. αβστινετε ϝος αβ ομνι μαλο."
# inp = "11.2 θυι αυτεμ νον ποτεστ σε ιν ηις γυβερναρε, #3υομοδο αλιι προνυντιατ ηοε? σι #3υις νον σε αβστινυεριτ αβ αϝαριτια, αβ ιδολολατρια ξοιν#3υιναβιτυρ ετ ταμ#3υαμ ιντερ γεντες ιυδιξαβιτυρ, #3υι ιγνοραντ ιυδιξιυμ δομινι. αυτ νεσξιμυς, #3υια σανξτι μυνδυμ ιυδιξαβυντ? σιξυτ παυλυς δοξετ."
# inp = "11.3 εγο αυτεμ νιηιλ ταλε σενσι ιν ϝοβις ϝελ αυδιϝι, ιν #3υιβυς λαβοραϝιτ βεατυς παυλυς, #3υι εστις ιν πρινξιπιο επιστυλαε ειυς. δε ϝοβις ετενιμ γλοριατυρ ιν ομνιβυς εξξλεσιις, #3υαε δομινυμ σολαξ τυνξ ξογνοϝεραντ; νος αυτεμ νονδυμ ξογνοϝεραμυς."
# inp = "11.4 Ωαλδε εργο, φρατρες, ξοντριστορ προ ιλλο ετ προ ξονιυγε ειυς, #3υιβυς δετ δομινυς παενιτεντιαμ ϝεραμ. σοβριι εργο εστοτε ετ ϝος ιν ηοξ: ετ νον σιξυτ ινιμιξος ταλες εχιστιμετις, σεδ σιξυτ πασσιβιλια μεμβρα ετ ερραντια εος ρεϝοξατε, υτ ομνιυμ ϝεστρυν. ξορπυς σαλϝετις. ηοξ ενιμ αγεντες ϝος ιπσος αεδιφιξατις."
# inp = "12.1 ξονφιδο ενιμ ϝος βενε εχερξιτατος εσσε ιν σαξρις λιτερις ετ νιηιλ ϝος λατετ; μιηι αυτεμ νον εστ ξονξεσσυμ. μοδο, υτ ηις σξριπτυρις διξτυμ εστ, ιρασξιμινι ετ νολιτε πεξξαρε, ετ σολ νον οξξιδατ συπερ ιραξυνδιαμ ϝεστραμ. βεατυς, #3υι μεμινεριτ; #3υοδ εγο ξρεδο εσσε ιν ϝοβις."
# inp = "12.2 δευς αυτεμ ετ πατερ δομινι νοστρι ιεσυ ξηριστι, ετ ιπσε σεμπιτερνυς ποντιφεχ, δει φιλιυς λεσυς ξηριστυς, αεδιφιξετ ϝος ιν φιδε ετ ϝεριτατε ετ ιν ομνι μανσυετυδινε ετ σινε ιραξυνδια ετ ιν πατιεντια ετ ιν λονγανιμιτατε ετ τολεραντια ετ ξαστιτατε; ετ δετ ϝοβις σορτεμ ετ παρτεμ ιντερ σανξτος συος ετ νοβις ϝοβισξυμ ετ ομνιβυς, #3υι συντ συβ ξαελο, #3υι ξρεδιτυρι συντ ιν δορνινυμ νοστρυμ ετ δευμ ιεσυμ ξηριστυμ ετ ιν ιπσιυς πατρεμ, #3υι ρεσυσξιταϝιτ ευμ α μορτυις."
# inp = "12.3 προ ομνιβυς σανξτις ορατε. ορατε ετιαμ προ ρεγιβυς ετ ποτεστατιβυς ετ πρινξιπιβυς ατ#3υε προ περσε#3υεντιβυς ετ οδιεντιβυς ϝος ετ προ ινιμιξις ξρυξις, υτ φρυξτυς ϝεστερ μανιφεστυς σιτ ιν ομνιβυς, υτ σιτις ιν ιλλο περφεξτι."
# inp = "ετ δε ιπσο λγνατιο ετ δε ηις, #3υι ξυμ εο συντ, #3υοδ ξερτιυς αγνοϝεριτις, σιγνιφιξατε."
# inp = "14.1 ηαξξ ϝοβις σξριπσι περ ξρεσξεντεμ, θυεμ ιν πραεσεντι ξορνμευδαϝι ϝοβις ετ νυνε ξομμενδο. ξονϝερσατυς εστ ενιμ νοβισξυμ ινξυλπαβιλιτερ; ξρεδο θυια ετ ϝοβισξυμ σιμιλιτερ. σορορεμ αυτεμ ειυς βαβεβιτις ξομμενδαταμ, ξυμ ϝενεριτ αδ ϝος. ινξολυμες εστοτε ιν δομινο ιεσυ ξηριστο ιν γρατια ξυμ ομνιβυς ϝεστρις. αμεν."


print(inp.translate(str.maketrans(a, b)).replace("#3", "q"))
